from database_saver import check_verb_exists, save_verb_conjugs_to_db, save_verbs_to_db, setup_database
from html_fetcher import fetch_html
from scrape_arabikey import scrape_arabikey_for_verbs
from utils import normalize_verb
from verb_scraper import fetch_verbs_from_multiple_pages 


def main():
    setup_database()
    url_template = "https://corpus.quran.com/verbs.jsp?page={}"
    max_page = 11  
    all_verbs = fetch_verbs_from_multiple_pages(fetch_html_func=fetch_html, url_template=url_template, max_pages=max_page)
    save_verbs_to_db(all_verbs)
    only_verbs = [normalize_verb(v["Verb"]) for v in all_verbs]
    unfound_verbs = ['عَلِمَ', 'أَتَى', 'رَآ', 'أَنْزَلَ', 'لَيْسَ', 'نَظَرَ', 'أَوْحَىٓ', 'أَلْقَىٓ', 'أَنْفَقَ', 'حَبَّ', 'قَضَى', 'جَرَى', 'قَاتَلَ','قَتَلَ',  'يَذَرَ', 'حَسِبَ', 'مَلَكَتْ', 'أَنذَرَ', 'أَدْخَلَ', 'بِئْسَ', 'خَشِىَ', 'أَرَيْ', 'مَّاتَ', 'بُشِّرَ', 'رَّضِىَ', 'يَحْزُن', 'اِسْتَوَىٓ', 'نَسِىَ', 'رَّحِمَ', 'جَٰهَدَ', 'جَٰدَلُ', 'يَشْعُرُ', 'أَذِنَ', 'أَنجَى', 'يَرْجُوا۟', 'مَّشَ', 'اِسْتُهْزِئَ', 'بَلَوْ', 'أَعَدَّ', 'تَعَٰلَى', 'أَنشَأَ', 'يَضُرَّ', 'يَفْقَهُ', 'أُخْفِىَ', 'ذُكِّرَ', 'أُعِيدُ', 'مَّتَّعْ', 'نِعْمَ', 'وَفَّىٓ', 'أُغْرِقُ', 'يَتَفَكَّرُ', 'اِنقَلَبَ', 'أُفِكَ', 'خَسِرَ', 'أَنۢبَتَ', 'اِنْتَهَى', 'أُوذِىَ', 'يُبْدِىَ', 'شَرِبَ', 'صَنَعُ', 'غَلَبُ', 'أَعْتَدَتْ', 'كَفَّرَ', 'لَقُ', 'يَصْلَى', 'يَصِفُ', 'اِسْتَـْٔذَنَ', 'حَبِطَ', 'يَحْذَرُ', 'أَخْزَيْ', 'تَدْرِى', 'قُطِعَ', 'مَّنَعَ', 'يُنظَرُ', 'يُوقِنُ', 'سَخِرَ', 'عَٰهَدَ', 'يَقْرَبُ', 'يَنَالُ', 'هَادُ', 'عُذْ', 'اِسْتَقَٰمُ', 'يَصِلُ', 'يُولِجُ', 'يُؤَاخِذُ', 'آوَىٓ', 'يَسْتَحْىِۦٓ', 'رَكِبَ', 'يَتَسَاءَلُ', 'يُسَٰرِعُ', 'يُضَٰعِفُ', 'اِنطَلَقَ', 'يَقْبَلُ', 'يَلْعَبْ', 'يَنطِقُ', 'بَٰرَكَ', 'اِبْتَلَىٓ', 'أُجِيبَت', 'رَٰوَدُ', 'أَسْقَيْ', 'يَطْمَعُ', 'تَعَالَ', 'أَغْوَيْ', 'كِيدُ', 'يَنتَظِرُ', 'يَهْبِطُ', 'يَسْتَبْشِرُ', 'حَىَّ', 'سِيقَ', 'شَاقُّ', 'ضَحِكَتْ', 'اِضْطُرَّ', 'طَّلَعَ', 'يَعْمَهُ', 'عَمِىَ', 'يُكَلِّفُ', 'أُمْطِرَتْ', 'تَنَٰزَعُ', 'تَنَزَّلَتْ', 'أَنسَى', 'اِنتَصَرَ', 'يُنقَصُ', 'يَزِرُ', 'يَسْتَأْخِرُ', 'يَنۢبَغِى', 'بَلَّغْ', 'ثُقِفُ', 'يُجِيرُ', 'يَخْفَى', 'يَصْفَحُ', 'ظَٰهَرُ', 'يَسْتَفْتُ', 'فُجِّرَتْ', 'فَرَّتْ', 'مُلِئَتْ', 'يَتَمَنَّ', 'نَقَضَتْ', 'اِنتَقَمْ', 'نَّكَثَ', 'وَسِعَ', 'اثَرَ', 'يُؤَدِّ', 'يَبْخَسْ', 'أَجْرَمُ', 'يَجْهَلُ', 'أَحْصَنَتْ', 'حُمِّلَ', 'دَرَسُ', 'دَفَعْ', 'ذُبِحَ', 'أَرْضَعَتْ', 'يَرْكَعُ', 'يَرْهَقُ', 'زُوِّجَتْ', 'سَلَفَ', 'سُيِّرَتْ', 'يَشْفَعُ', 'اِنشَقَّ', 'طُمِسَتْ', 'عَتَ', 'يَعْتَذِرُ', 'يَعْرُجُ', 'يُعَمَّرُ', 'يُفْتِي', 'تَقَرَّ', 'تَّقَطَّعَ', 'أُكْرِهَ', 'يَمْتَرُ', 'اِهْجُرْ', 'أَوْصَٰ', 'تَوَاصَ', 'أَوْقَدُ', 'تَأْسَ', 'يُبْطِلَ', 'يَتَبَوَّأُ', 'ثَقُلَتْ', 'اِسْتَحَبُّ', 'يُحَرِّفُ', 'يُحَافِظُ', 'يُحِقَّ', 'حُلُّ', 'يَخْرُصُ', 'يُخَوِّفُ', 'يُدَبِّرُ', 'يَتَدَبَّرُ', 'يَدْرَؤُا۟', 'يَرْغَبُ', 'اِرْتَقِبْ', 'أُزْلِفَتْ', 'يَسُومُ', 'تَشَٰبَهَ', 'شَرَ', 'شَقُ', 'أَصَرُّ', 'يُصَلَّبُ', 'أُصْلِي']
    unfound_verbs = [normalize_verb(v) for v in unfound_verbs]
    verb_conj =scrape_arabikey_for_verbs(verbs=unfound_verbs, on_save=save_verb_conjugs_to_db, check_exist=check_verb_exists)
    print(f"{len(verb_conj)} are added to DB.")

if __name__ == "__main__":
    main()
